Revit 2027 API
BuiltInFailures.KeyBasedTreeEntryFailures.BadClassificationLevel Property
 Level [Level] of Classification [Code] is not an integer from 1 to 5.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BadClassificationLevel { get; }
Public Shared ReadOnly Property BadClassificationLevel As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BadClassificationLevel {
	FailureDefinitionId^ get ();
}
static member BadClassificationLevel : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.KeyBasedTreeEntryFailures Class
Autodesk.Revit.DB Namespace